 Identification division.
 Program-id. Subverb.
 Environment division.
 Data division.
 Working-storage section.
 77    A	pic s9(3)v9(2) value 0.
 77    B	 pic s9(3)v9(2) value 0.
 77    E-B	 pic +z(3).z(2).

 Procedure division.
 Para-1.
        Display "Enter first number  :" with no advancing.
        Accept  A.
        Display "Enter second number :" with no advancing.
        Accept  B.
        Subtract  A from B.
        Move B to E-B.
        Display "b-a = "E-B.
        Stop run.
