 IDENTIFICATION DIVISION.
 PROGRAM-ID. FIZZBUZZ.
 ENVIRONMENT DIVISION.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 NUM1 PIC 99.
 01 NUM2 PIC 99.
 01 REM1 PIC 999.
 01 REM2 PIC 999.
 
 
 PROCEDURE DIVISION.
 DISPLAY "ENTER YOUR FIRST NUMBER :" WITH NO ADVANCING.
 ACCEPT NUM2.
 PERFORM VARYING NUM1 FROM 1 BY 1 UNTIL NUM1 > NUM2
 DIVIDE NUM1 BY 3 GIVING NUM2 REMAINDER REM1
 DIVIDE NUM2 BY 5 GIVING NUM1 REMAINDER REM2
 	
 	EVALUATE REM1 ALSO REM2
 WHEN ZERO IS ALSO ZERO
  DISPLAY "FIZZBUZZ"
	 WHEN ZERO ALSO ANY
 DISPLAY "FIZZ"
	 WHEN ANY ALSO ZERO
 DISPLAY "BUZZ"
 	WHEN OTHER
 DISPLAY NUM1
 END-EVALUATE
 END-PERFORM
 
 


 
